Revit 2027 API
AssetPropertyDoubleArray4d.GetValueAsDoubles Method
 Gets the value property as doubles.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetValueAsDoubles()
Public Function GetValueAsDoubles As IList(Of Double)
public:
IList<double>^ GetValueAsDoubles()
member GetValueAsDoubles : unit -> IList<float>
Return Value
IList<Double>
 The value as doubles.
See Also
Reference
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace